[
	{
		"title": "LM MOKOENA'S CUT & EDGE, KITCHEN UNITS & BUILT-IN CUPBOARDS",
		"description": [
			"When I first built this project, it lived entirely on Google Sites. While it was a great starting point, I quickly ran into the platform’s limits: restricted layouts, minimal control over styling, and little room for interactivity. I decided to rebuild the entire site from scratch using HTML, CSS, and JavaScript. This wasn’t just a cosmetic change—it meant rethinking how the content was structured, how the design responded to different screen sizes, and how users interacted with the site.",
			"Key steps in the transformation:",
			"Planning the structure: I mapped out a clean, semantic HTML layout to make future updates easier.",
			"Custom design & styling: Using modern CSS (Flexbox & Grid), I recreated and improved the visual design, ensuring a fully responsive experience across devices.",
			"Interactive features: Vanilla JavaScript added subtle animations, smooth navigation, and improved usability—features that weren’t possible on Google Sites.",
			"Performance & SEO: With direct control over the code, I optimized loading times, used best-practice metadata, and implemented accessible markup."
		],
		"image": "https://raw.githubusercontent.com/mphomolefe730/portfolio-website/refs/heads/main/src/assets/website_images/lmmokoena.png",
		"timeline": [
			{
				"date": "",
				"description": ""
			}
		],
		"resource_images": [
			{
				"title": "HTML",
				"image_link": "#"
			}
		],
		"type": "website",
		"warning": false,
		"project_status": "Done",
		"project_link": "#",
		"video_link": "#",
		"category": ["all","personal"],
		"last_update": "8 September 2025"
	},{
		"title": "Reverse 2048",
		"description": [
			"Write C++ code for a program that reads in an unknown number of “Reverse 2048” games. The program must then use an algorithm to solve each of the solvable puzzles given in the input file", 
			"Reverse 2048 is a variation of the classic 2048 puzzle game, a sliding tile game that is played on a 4×4 grid. Unlike the original game, where the goal is to merge tiles to reach 2048, in Reverse 2048, the player must divide tiles to reach the smallest possible value, typically tile 2. The game is played using numerical tiles, each having values that are powers of 2. The main rules of the game are:", 
			"1) Players slide tiles in four possible directions (up, down, left, right).",
			"2) When two tiles of the same value collide, they merge into one tile with half the value.",
			"3) The game ends when there are no more valid moves or when the smallest achievable value has been reached."
		],
		"image": "https://raw.githubusercontent.com/mphomolefe730/portfolio-website/refs/heads/main/src/assets/website_images/reverse_2048.png",
		"timeline": [
			{
				"date": "Problem to be solved",
				"description": "Develop a C++ program that can solve any given configuration of Reverse 2048 based on specified project requirements and constraints. Since the game requires a different strategic approach than traditional 2048, implementation must optimize moves to reach the smallest tile possible (tile with a value of 2) before the board becomes full."
			},{
				"date": "Initial Board Setup",
				"description": "The board consists of a 4×4 grid initially filled with 2 tiles having a value of 2048. New tiles appear after each move, following a random pattern. The new tiles have large numerical values of either 2048 or 1024 (no tile value lower than this should appear on the grid)"
			},{
				"date": "Movement",
				"description": "Players can slide all tiles in a chosen direction (left, right, up, down). When two tiles of the same value collide, they merge into one tile with half the value. For example, Two 2048s combine into a 1024, Two 1024s combine into a 512, and so on, all down to two 4s combine into a 2. A move is valid only if at least one tile can be merged or moved."
			},{
				"date": "End Condition",
				"description": "The game is won if a tile of value 2 is reached before the board becomes full. The game is lost if there are no valid moves left."
			},{
				"date": "Project Constraints",
				"description": "Develop two different algorithms that will play Reverse 2048 against each other. The selected algorithms will exclusively be referred to as Alg 1 and Alg 2. The two algorithms will play against each other on separate boards at the same time. The game will start at the same spot on the both boards. The first algorithm to complete the game will be considered the winner. A maximum of 1000 moves per game per algorithm is allowed. If this limit is exceeded, the game ends as unsolved."
			},{
				"date": "Input Data",
				"description": "The file holding the configurations is called reverse 2048.txt. An example of the input would be as follows: 512 , 3 (a game of reverse 512 on a board size of 3 × 3)"
			}
		],
		"resource_images": [
			{
				"title": "C++",
				"image_link": "https://raw.githubusercontent.com/mphomolefe730/portfolio-website/refs/heads/main/src/assets/logos/ISO_C++_Logo.png"
			}
		],
		"type": "game",
		"warning": false,
		"project_status": "Done",
		"project_link": "https://github.com/mphomolefe730/reverse-2048-game",
		"video_link": "https://drive.google.com/file/d/1GrIg0EkcoKcyRTy5-fTH2AJKxaQ4Fymm/preview",
		"category": ["all","personal"],
		"last_update": "27 April 2025"
	},{
		"title": "Social Media",
		"description": ["Tasked to design a new social media network, inspired by existing platforms like Facebook, TikTok, Twitter, and Instagram, that connects individuals and businesses."],
		"image": "https://raw.githubusercontent.com/mphomolefe730/portfolio-website/refs/heads/main/src/assets/website_images/social_media.png",
		"timeline":[],
		"resource_images": [
			{
				"title": "Php",
				"image_link": "https://raw.githubusercontent.com/mphomolefe730/portfolio-website/refs/heads/main/src/assets/logos/Official_PHP_Logo.svg"
			},{
				"title": "Docker",
				"image_link": "https://raw.githubusercontent.com/mphomolefe730/portfolio-website/refs/heads/main/src/assets/logos/docker_logo.png"
			},{
				"title": "MySQL",
				"image_link": "https://raw.githubusercontent.com/mphomolefe730/portfolio-website/refs/heads/main/src/assets/logos/sql.png"
			}
		],
		"type": "website",
		"warning": false,
		"project_status": "Deployment",
		"project_link": "#",
		"video_link": "#",
		"category": ["all","personal"],
		"last_update": "10 October 2024"
	},
	{
		"title": "Betway Aviator Analysis",
		"description": ["This project aims to analyze a popular gambling game to uncover patterns that can potentially increase the win rate for players. By leveraging data collection techniques such as screen scraping, we gathered extensive data on betting outcomes and odds. The analysis was conducted using Python, Beautiful Soup for web scraping, and Jupyter Notebook for data visualization and exploration - also side Pandasa and more"],
		"image":"https://raw.githubusercontent.com/mphomolefe730/portfolio-website/refs/heads/main/src/assets/website_images/betway_video.png",
		"timeline":[],
		"resource_images": [
			{
				"title":"Python",
				"image_link": "https://raw.githubusercontent.com/mphomolefe730/portfolio-website/refs/heads/main/src/assets/logos/python.jpeg"
			},
			{
				"title": "Jutyper Notebook",
				"image_link": "https://raw.githubusercontent.com/mphomolefe730/portfolio-website/refs/heads/main/src/assets/logos/Jupyter_logo.png"
			},{
				"title": "BeatifulSoap",
				"image_link": "#"
			}
		],
		"type": "analysis",
		"warning": false,
		"project_status": "Done",
		"project_link": "https://github.com/mphomolefe730/betway-system/",
		"video_link": "https://drive.google.com/file/d/1Q3l1GKrNAgFdK9dF_5EUqbjiUix1Pexk/preview",
		"category": ["all","personal","data science"],
		"last_update": "23 August 2024"
	},
	{
		"title": "Ecommerce Connect",
		"description": ["A e-commerce website for both buyers and sells. The web application has a Content Management System (CMS) for buyers to see their inventory, orders, stuff administrative tools and more. It also offer financial records and charts to help businesses to better manage and understand their financies.", "Ecommerce Connect was establish to help small to medium business owner to have a centralized platform where users can find them - It's main audience being the informational section, An unexplored, cash heavy  market who can't meet most populate platforms high start up fees."],
		"timeline":[
			{
				"date":"3 - 24 March 2024",
				"description":"Convert an existing static website into a dynmamic web application (HTML & Javscript -> Angular, MongoDB & ExpressJS). This process was give basic funtionality to ensure the new feature we working, at this stage - the application was still mainly run on local devices. Introducted feature: Login and Registration, Recent view items, New styling, Search, Recently search and recently viewed history, Connection with api and database, Product description view,& environment file for the api link"
			},
			{
				"date":"9 April - 9 June 2024",
				"description":"Introduction of sellers portal. The process of dividing the application into sellers and customer version. This is the phase of allowing seller to edit and their profiles and products as they see fit. Feature Introducted: Order and sell analytics represented using graphs, Ability to accept and decline orders, Sellers being able to edit thier profiles, Custumers being able to see seller profiles, Customers being able to checkout, Chat function for all orders."
			},
			{
				"date":"3 - 30 August 2024",
				"description":"Bug fixes and existing feature improvements. Introducted feature: Add business profiles - to help large organisations better manage their stuff, Seller order filtering to better pioritize their orders, Add business portal to help seller better understand platform and tools, Customers can add notes to their order(s) - to help seller understand their order better."
			},
			{
				"date": "8 March 2025",
				"description": "Add product activity status, this will allow sells to choose whether they want their product to be seen by people or not."
			},
			{
				"date": "19 March 2025",
				"description": "Add product review section, people can see a products reviews regardless logged in or not, but you will need to logged in to interact with the reviews and you will need to have purchased the product to leave a review. currently, you have countless attempts at leave review but future will e limited to amount of times purchased.  "
			},
			{
				"date": "21 March 2025",
				"description": "Add product recommendation. Product recommednation are based on category relation, and future user patterns. There is a limit of 10 product recommendtions."
			}
		],
		"image": "https://raw.githubusercontent.com/mphomolefe730/portfolio-website/refs/heads/main/src/assets/website_images/ecommerce_connect.png",
		"resource_images": [
			{
				"title": "Angular",
				"image_link": "https://raw.githubusercontent.com/mphomolefe730/portfolio-website/refs/heads/main/src/assets/logos/icon_angular.svg"
			},{
				"title": "MongoDB",
				"image_link": "https://raw.githubusercontent.com/mphomolefe730/portfolio-website/refs/heads/main/src/assets/logos/9074155_mongodb_icon.svg"
			},{
				"title": "Redis",
				"image_link": "https://raw.githubusercontent.com/mphomolefe730/portfolio-website/refs/heads/main/src/assets/logos/redis_logo.svg"
			},{
				"title": "SocketIO",
				"image_link": "https://raw.githubusercontent.com/mphomolefe730/portfolio-website/refs/heads/main/src/assets/logos/socketio-icon.svg"
			},{
				"title": "Docker",
				"image_link": "https://raw.githubusercontent.com/mphomolefe730/portfolio-website/refs/heads/main/src/assets/logos/docker_logo.png"
			},{
				"title": "ExpressJs",
				"image_link": "https://raw.githubusercontent.com/mphomolefe730/portfolio-website/refs/heads/main/src/assets/logos/expressjs_logo.png"
			},{
				"title": "NGINX",
				"image_link": "#"
			}
		],
		"type": "website",
		"warning": false,
		"project_status": "Maintenance",
		"project_link": "https://ecommerce-test-3v4i.onrender.com/",
		"confirmation_link": "https://ecommerce-test-api-i2se.onrender.com/api/products",
		"video_link": "https://drive.google.com/file/d/11Ro4Zd11bmnPDBBMVXc8t90WkrNTor7b/preview",
		"category": ["all","personal"],
		"last_update": "03 March 2024"
	},
	{
		"title": "Rydly",
		"description": ["Rydly is a dynamic ride-sharing service that refines the way users commute, connecting private vehicle owners with individuals sharing similar routes. Rydly offers carpool services, optimized journeys for a more sustainable and cost-effective travel experience, Emergency services like SOS dispatch, ride sharing and live tracking for both driver and commuter, Communication features like on platform live chat and calls, Intergration with state services for account verification and auditting, On demand invoices and trip details, Different ride and pricing options to meet individual needs."],
		"timeline":[
			{
				"date": "Oct 2023",
				"description": "Introduction to the team and project. Member are made familiar eith exist tech stack being used by company, given time to familiarise themselves with the code based of the project, individual goal setting and given an clear vision of what is expected from each individual involved. During this time, testing and analysis is done for both the project and individual members of the team to identify gaps and a plan of action."
			},{
				"date":"November 2023 - December 2023",
				"description":"Implementation of fixes, feature and structure based on stackholder requirements. The plan was structured into 3 phase (Structure, Fixes/Improvement and Feature). Structure, The team changes the overall structure of existing project to not just help it scale better by adding cloud platform like AWS and Azure into the project, removing anything that hard coded and divide services to improve and optimizethem based on company resources."
			},{
				"date":"January 2024 - April 2024",
				"description":"Fixes/Improvements, since its an already existing project and has functionality and feature, the team is asked to fix and adjust them to current infrustructure and make improvements where is needed. This phase involved a lot of end-to-end testing as it introducted some breaking change in some services - alongside some unexpected behaviour and bugs. As an NDA was signed I can not mention everything but here are a few im allowed to share - some pages in the application were mixing with each other or not closing at all, we needed to implement a new way of managing state and use tags associated with the library of the framework as it was not done before. Another involved is the map and locaction services not working on some device (mainly huawei device because the application is using google map and service), a solution to this was constantly change and implemented different dependence and library and using the one with the most promising results."
			},{
				"date":"May 2024 - December 2024",
				"description":"Feature, the stakeholder had some requires for new feature to be added or check if they can be done. Some of the things in the application we did not have full control of and as such flexibilty was limited, whether that be payment, information authoritarian using state systems and services ETC. During this phase, it was about getting as much done and updating their status whether it can be done or not and also managing the time and resources needed for them."
			}
		],
		"image": "https://raw.githubusercontent.com/mphomolefe730/portfolio-website/refs/heads/main/src/assets/website_images/rydly.png",
		"resource_images": [
			{
				"title": "Ionic Angular",
				"image_link": "https://raw.githubusercontent.com/mphomolefe730/portfolio-website/refs/heads/main/src/assets/logos/ionic_logo.png"
			},{
				"title": "PostgresSQL",
				"image_link": "https://raw.githubusercontent.com/mphomolefe730/portfolio-website/refs/heads/main/src/assets/logos/postgresSQL_elephant_logo.png"
			},{
				"title": "Redis",
				"image_link": "https://raw.githubusercontent.com/mphomolefe730/portfolio-website/refs/heads/main/src/assets/logos/redis_logo.svg"
			},{
				"title": "Dotnet MVC",
				"image_link": "https://raw.githubusercontent.com/mphomolefe730/portfolio-website/refs/heads/main/src/assets/logos/dotnet_mvc_logo.png"
			},{
				"title": "AWS",
				"image_link": "https://raw.githubusercontent.com/mphomolefe730/portfolio-website/refs/heads/main/src/assets/logos/aws_logo.png"
			},{
				"title": "Docker",
				"image_link": "https://raw.githubusercontent.com/mphomolefe730/portfolio-website/refs/heads/main/src/assets/logos/docker_logo.png"
			}
		],
		"type": "website",
		"warning": false,
		"project_status": "Maintenance",
		"project_link": "https://rydly.co.za",
		"video_link": "#",
		"category": ["all","commercial"],
		"last_update": "02 October 2023"
	},
	{
		"title": "Travel Vista",
		"description": ["A group project for Richfield Hackathon using Trip Advisor API, Angular, Tailwind and PhP. Created to help travelers plan their ideal adventure by get access to flights,restaurants, hotels and attractions. Website has able to also save card information, trip history and profile page. I was responsible for managing the team and front-end development, and teaching and helping the team with Angular."],
		"timeline":[
			{
				"date":"5 - 15 September 2023",
				"description":"Pre-planning process. All dependencies and file related to QR Code scanning are shared, these will be the initual project for everyone involved. The initual plan for the project was to use PHP and mySQL, but later changed. This is because hackathon topics were changed and as such, the project change from using PHP and mySQL to using Angular and MongoDB. The application was given general styling based on Figma design, this include feeatures like the Navbar, make application mobile responsive, global styles for font and color and linking external links for fonts, logos and more."
			},
			{
				"date":"17 September 2024",
				"description":"Add tailwind for easier styling. This was need for a large time, mainly full of beginner developers who are unfamiliar with the tools beginning used. The homepage was also completed at this stage. This was done to help those who are unfimiliar with the tools get a framework to use moving forward. This is the point where everyone was assign a page they are responsible for based on a figma design"
			},
			{
				"date":"21 September 2024",
				"description":"Add ability to search [done by me], view hotels, footer, about section regarding the organisation, user page for managing account (wallet, setting, history) [done by me], explore page[done by me], dark mode [done by me], testimonials, sign in and sign up page and splash page [done by me]. "
			}
		],
		"image": "https://raw.githubusercontent.com/mphomolefe730/portfolio-website/refs/heads/main/src/assets/website_images/#",
		"resource_images": [
			{
				"title": "Angular",
				"image_link": "https://raw.githubusercontent.com/mphomolefe730/portfolio-website/refs/heads/main/src/assets/logos/1174949_js_react js_logo_react_react native_icon.svg"
			},{
				"title": "Tailwind",
				"image_link": "https://raw.githubusercontent.com/mphomolefe730/portfolio-website/refs/heads/main/src/assets/logos/tailwindcss-mark.3c5441fc7a190fb1800d4a5c7f07ba4b1345a9c8.svg"
			},{
				"title": "Php",
				"image_link": "https://raw.githubusercontent.com/mphomolefe730/portfolio-website/refs/heads/main/src/assets/logos/Official_PHP_Logo.svg"
			}
		],
		"type": "website",
		"warning": false,
		"project_status": "Deployment",
		"project_link": "#",
		"video_link": "#",
		"category": ["all","collaborative","hackathon"],
		"last_update": "28 September 2023"
	},
	{
		"title": "Code Pilot",
		"description": ["This website takes in code and fixes it using chatGPT3/gpt-3. The API has been disabled so contact me if you want to try it out and I'll temporarily activate it"],
		"timeline":[],
		"image": "https://raw.githubusercontent.com/mphomolefe730/portfolio-website/refs/heads/main/src/assets/website_images/code_pilot.png",
		"resource_images": [
			{
				"title": "React",
				"image_link": "https://raw.githubusercontent.com/mphomolefe730/portfolio-website/refs/heads/main/src/assets/logos/1174949_js_react js_logo_react_react native_icon.svg"
			},{
				"title": "Firebase",
				"image_link": "https://raw.githubusercontent.com/mphomolefe730/portfolio-website/refs/heads/main/src/assets/logos/Logomark_Monochrome_Optimized_Black.svg"
			},{
				"title": "Bootstrap",
				"image_link": "https://raw.githubusercontent.com/mphomolefe730/portfolio-website/refs/heads/main/src/assets/logos/bootstrap-4.svg"
			}
		],
		"type": "website",
		"warning": false,
		"project_status": "Maintenance",
		"project_link": "https://codepilot4.web.app/",
		"video_link": "https://drive.google.com/file/d/1lfqHzPMpw_wTpJGXIQrXDQGnwsx-50gN/preview",
		"category": ["all","collaborative","hackathon"],
		"last_update": "22 June 2023"
	}
]
